{
    "my_book_recs": [
        {
            "book_one": {
                "title": "The Joys of Motherhood",
                "author": "Buchi Emecheta",
                "details": "The novel tells the tragic story of Nnu-Ego, daughter of Nwokocha Agbadi and Ona, who had a bad fate with childbearing. This novel explores the life of a Nigerian woman, Nnu Ego. Nnu’s life centres on her children and through them, she gains the respect of her community. Traditional tribal values and customs begin to shift with increasing colonial presence and influence, pushing Ego to challenge accepted notions of mother, wife, and woman. Through Nnu Ego’s journey, Emecheta forces her readers to consider the dilemmas associated with adopting new ideas and practices against the inclination to cleave to tradition. In this novel, Emecheta reveals and celebrates the pleasures derived from fulfilling responsibilities related to family matters in child bearing, mothering, and nurturing activities among women. However, the author additionally highlights how the ‘joys of motherhood’ also include anxiety, obligation, and pain."
            }
        },
        {
            "book_two": {
                "title": "Weep Not, Child",
                "author": " Ngũgĩ wa Thiong'o",
                "details": "Weep Not, Child is Kenyan author Ngũgĩ wa Thiong'o's first novel, published in 1964 under the name James Ngugi. It was the first English novel to be published by an East African. Thiong'o's works deal with the relationship between Africans and the British colonists in Africa, and are heavily critical of British colonial rule. Specifically, Weep Not, Child deals with the Mau Mau Uprising, and the bewildering dispossession of an entire people from their ancestral land. Ngũgĩ wrote the novel while he was a student at Makerere University.The book is divided into two parts and eighteen chapters. Part one deals mostly with the education of Njoroge, while part two deals with the rising revolutionary, anti-colonist turmoil in Kenya."
            }
        },
        {
            "book_three": {
                "title": "A Man of the People",
                "author": "Chinua Achiebe",
                "details": "A Man of the People  was written as a satirical piece, A Man of the People follows a story told by Odili, a young and educated narrator, on his conflict with Chief Nanga, his former teacher who enters a career in politics in an unnamed fictional 20th century African country. Odili represents the changing younger generation; Nanga represents the traditional West African customs, inspired by that of Achebe's native Nigeria. The book ends with a military coup, similar to the real-life coups of Johnson Aguiyi-Ironsi, Chukwuma Kaduna Nzeogwu and Yakubu Gowon."
            }
        },
        {
            "book_four": {
                "title": "The Old Man and the Medal",
                "author": "Ferdinand Oyono",
                "details": "Writing in French in the 1950s, Ferdinand Léopold Oyono (1929-2010) had only a brief literary career, but his anticolonialist novels are considered classics of twentieth-century African literature. Like Oyono's Houseboy, also available from Waveland Press, this novel fiercely satirizes the false pretenses of European colonial rule in Africa. Meka, a village elder, has always been loyal to the white man. It is with pride that he first hears he is to receive a medal. While waiting for the ceremony, however, Meka's pride gives way to skepticism. At the same time, his wife has realized that the medal is being given to her husband as compensation for the sacrifices they have made. The events following the ceremony confirm Meka's new estimation of the white man.Both subtle and oftentimes humorous, this beautifully told story lays bare the hollowness of the mission in Africa. It fuels opportunities for discussing colonial politics around class and race as well as for exploring indigenous Cameroon life and values."
            }
        },
        {
            "book_five": {
                "title": "A Woman in Her Prime",
                "author": "Asare Konadu",
                "details": "A young woman makes that all-important rite of passage from adolescence to adulthood. However, her early adult life is marred by childlessness in a society that places a great premium on children and motherhood as the ultimate mark of womanhood."
            }
        },
        {
            "book_six": {
                "title": "The Trial of Christopher Okigbo",
                "author": "Ali A. Mazrui",
                "details": "The Trial of Christopher Okigbo” is the story of Hamisi, a Kenyan Muslim, who is killed in an automobile accident and finds himself in a place called After‐Africa, a world beyond the grave that combines the best of Christian, Muslim and traditional African versions of heaven. Though we get only suggestions of what it is like there, this setting remains the most memorable feature of this fine little novel -nytimes.com"
            }
        },
        {
            "book_seven": {
                "title": "Petals of Blood",
                "author": "Ngũgĩ wa Thiong'o",
                "details": "After a terrible murder in the village of Ilmorog, four suspects are placed in detention: Munira the headmaster; Abdullah the storekeeper; Karega the assistant teacher and 'barmaid' Wanja. The lives of these four characters are inextricably linked with the lives of the three murder victims, the fortunes of Ilmorog and with the fate of Kenya itself. Published to great controversy in 1977, Petals of Blood is as much a whodunnit as a political novel and satire. Ngũgĩ unfolds a human landscape that is both beautiful and horrifying, as tribalism and village life are manipulated in the name of progress by the cynical bureaucrats who came to power as heroes of liberation."
            }
        }
    ]
}